SisCajas/Plantillas/XML_RecargaVirtual/RevertirRecargaVirtualRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://claro.com.pe/esb/data/generico/claroGenericHeader/v1/" xmlns:v11="http://claro.com.pe/generic/messageFormat/v1.0/" xmlns:v12="http://claro.com.pe/esb/message/BSS_RecargaVirtual_v1/revertirRecargaVirtual/v1/">
   <soapenv:Header>
     <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username></wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"></wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
      <v1:headerRequest>
         <v1:canal></v1:canal>
         <v1:idAplicacion></v1:idAplicacion>
         <v1:usuarioAplicacion></v1:usuarioAplicacion>
         <v1:usuarioSesion></v1:usuarioSesion>
         <v1:idTransaccionESB></v1:idTransaccionESB>
         <v1:idTransaccionNegocio></v1:idTransaccionNegocio>
         <v1:fechaInicio></v1:fechaInicio>
         <v1:nodoAdicional></v1:nodoAdicional>
      </v1:headerRequest>
      <v11:HeaderRequest>
         <country></country>
         <language></language>
         <consumer></consumer>
         <system></system>
         <modulo></modulo>
         <pid></pid>
         <userId></userId>
         <dispositivo></dispositivo>
         <wsIp></wsIp>
         <operation></operation>
         <timestamp></timestamp>
         <msgType></msgType>
         <!--Optional:-->
         <VarArg>
            <!--Zero or more repetitions:-->
            <Arg>
               <key>?</key>
              <value>?</value>
            </Arg>
         </VarArg>
      </v11:HeaderRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v12:RevertirRecargaVirtualRequest>
         <v12:linea></v12:linea>
         <v12:estado></v12:estado>
         <v12:fecha></v12:fecha>
         <v12:nombreUsuario></v12:nombreUsuario>
         <v12:clave></v12:clave>
         <v12:Hlrflag></v12:Hlrflag>
         <v12:codigoExternalOrigen></v12:codigoExternalOrigen>
         <v12:external_origen></v12:external_origen>
         <v12:eventGetBalance>
            <v12:entityType value="?"/>
            <v12:entityId value="?"/>
            <v12:referenceNumber value="?"/>
            <!--Optional:-->
            <v12:spendGroupDetailsFlag value="?"/>
            <v12:eventSource value="?"/>
            <!--Optional:-->
            <v12:relationShipType value="0"/>
         </v12:eventGetBalance>
         <v12:eventChangeBalance>
            <v12:entityType value="?"/>
            <v12:entityId value="?"/>
            <v12:transactionType value="?"/>
            <v12:chargeExponent value="?"/>
            <!--Optional:-->
            <v12:payerValidity>
               <v12:validityPeriodType value="?"/>
               <v12:validityExtensionPolicy value="?"/>
               <v12:validityFlag value="?"/>
               <v12:numberOfvalidities value="?"/>
               <v12:validity-Info>
                  <!--0 to 5 repetitions:-->
                  <v12:validity value="?" sequence="?" validityFromLifecycle="?"/>
               </v12:validity-Info>
            </v12:payerValidity>
            <!--Optional:-->
            <v12:walletValidity>
               <v12:numberOfvalidities value="?"/>
               <v12:validity-Info>
                  <!--Zero or more repetitions:-->
                  <v12:validity value="?" validityWalletId="?" validityPeriodType="?" validityExtensionPolicy="?"/>
               </v12:validity-Info>
            </v12:walletValidity>
            <v12:referenceNumber value="?"/>
            <v12:eventSource value="?"/>
            <!--Optional:-->
            <v12:forceDebit value="?"/>
            <!--Optional:-->
            <v12:applyTax value="?"/>
            <!--Optional:-->
            <v12:externalApplicationAttribute1 value="?"/>
            <!--Optional:-->
            <v12:externalApplicationAttribute2 value="?"/>
            <!--Optional:-->
            <v12:externalApplicationAttribute3 value="?"/>
            <v12:numberOfTransactions value="?"/>
            <!--Optional:-->
            <v12:transaction-Info>
               <!--1 to 5 repetitions:-->
               <v12:transaction transactionAmount="?" walletId="?" articleId="?" balanceOption="?"/>
            </v12:transaction-Info>
         </v12:eventChangeBalance>
         <v12:cadenaComandoXML></v12:cadenaComandoXML>
         <v12:cadenaReqXML></v12:cadenaReqXML>
         <v12:estadoActualizar></v12:estadoActualizar>
         <v12:listaResquestOpcional>
            <!--1 or more repetitions:-->
            <v12:requestOpcional campo="?" valor="?"/>
         </v12:listaResquestOpcional>
      </v12:RevertirRecargaVirtualRequest>
   </soapenv:Body>
</soapenv:Envelope>